#参考资料：
https://www.freebuf.com/articles/system/218407.html                     最全Linux应急响应技巧
https://blog.csdn.net/weixin_42615308/article/details/88848666          /proc/{id}/目录详解




#检查思路：
1、top、ps aux、ps -ef，检查使用cpu、内存使用率，异常的进程名字
2、通过第一步，找到进程id之后，使用lsof -p ID，找到守护进程和命令；
3、与第二步并行，去/proc/{id}/这个目录，去检查exe（命令链接）、comm（进程命令）、cmdline（完整命令信息）、cwd文件；
  检查lastlog，登陆历史、操作历史，异常文件；
  lastb（lastb命令用于显示用户错误的登录列表，此指令可以发现系统的登录异常，/var/log/secure更详细），
  lastlog（最后一次登陆信息），
  last（最近的登陆信息）。
4、杀掉进程、通过2、3清除文件。
5、检查crontab定时任务。
6、是否被rootkit？有疑似痕迹，下载rootkit检测工具，检查一下，最好重装系统。


#处理思路，6大步骤:
1、识别现象，发现告警，意识到风险
2、然后隔离主机
3、备份数据
4、按照下面6步排查。
5、系统加固。修漏洞、打补丁，检查弱口令。
6、横向排查。

#####################更全的排查思路########################
这个地址写得很好。已fork它！！！   
https://github.com/Bypass007/Emergency-Response-Notes/blob/master/第一章：应急响应/第2篇：Linux入侵排查.md

6大步骤如下：
1、异常账号：uid为0的，奇怪的、新建的账号。
2、异常登陆、操作记录 日志：操作日志、系统日志（history、/var/log/下的日志），账号被爆破的日志（lastb、secure日志）。
3、异常进程：名字看起来很怪的，字母、数字混合。处理方式见上面，找到具体的命令、文件。
4、异常网络链接（以及端口服务）：外联异常IP、域名的链接，进程。
5、异常定时任务：不是自己人创建的。crontab；/etc/init.d目录下，而且在/etc/rc.d/rc*.d/有软连接的。
6、异常文件：最近7天增加的文件、777权限的文件，名字看见怪的文件，针对特定名字的（恶意文件名）进行find。


#linux日志解释：
可以看到在/var/log目录下存在很多的日志文件，接下来就对里面的一些常用日志文件进行分析
主要日志文件介绍：
内核及公共消息日志:/var/log/messages
计划任务日志：/var/log/cron
系统引导日志：/var/log/dmesg
邮件系统日志:/var/log/maillog
用户登录日志：/var/log/lastlog
/var/log/boot.log（记录系统在引导过程中发生的时间）
/var/log/secure (用户验证相关的安全性事件)，被爆破日志。
/var/log/wtmp(当前登录用户详细信息)
/var/log/btmp（记录失败的的记录）
/var/run/utmp（用户登录、注销及系统开、关等事件）

#根本原因
目前为止，我们知道黑客是植入了木马进行挖矿（入侵），第一种可能是通过外网的弱口令+文件上传拿到shell，拿到了root权限。
第二种可能是黑客通过其他的外网平台漏洞，然后进入内网，通过ssh批量爆破进入的，而且这个服务器确实是弱口令(强调一下，一般内网服务器都是弱口令，所以很容易批量拿下.....)
